Autodesk.Revit.DB.DetachFromCentralOption
Options for workset detachment behavior.
Since:
2013

Autodesk.Revit.DB.DetachFromCentralOption.ClearTransmittedSaveAsNewCentral
After opening the transmitted, workshared model, immediately resave it with its current name
and clear the transmitted flag.

Autodesk.Revit.DB.DetachFromCentralOption.DetachAndDiscardWorksets
Detach the model being opened from its central model and discard worksets/worksharing.

Autodesk.Revit.DB.DetachFromCentralOption.DetachAndPreserveWorksets
Detach the file being opened from its central file.

Autodesk.Revit.DB.DetachFromCentralOption.DoNotDetach
Do not detach the file being opened from its central file.